<?php
// -------------------------------------------------------------
//Настройки соединения для текущего сервера
// -------------------------------------------------------------

  //Параметры БД САМС
  $config  ['sams_db'] = array('localhost', 'sams', 'qwerty', 'squidctrl', 'utf8');
  //Параметры БД Режика
  $config ['rejik_db'] = array('localhost', 'rejik_adm', 'admin3741', 'rejik', 'utf8');


// -------------------------------------------------------------
//Вспомогательные опции
// -------------------------------------------------------------

  // Логировать действия админов
  $config['admin_log'] = True;

  //Режим отладки
  $config['debug_mode'] = True;

  //Название корневой папки проекта. Используется при указании абсолютного адреса.
  $config['proj_name'] = 'adm';

  //Количество ссылок на одной странице
  $config['urls_per_page'] = 250;

  //Секретный ключ сервера
  $config['private_key'] = 'secret';

  //ID этого сервера. Такой же как и в конфиге MySQL
  $config['server_id'] = 21;

  $config['servers'] = array(
    //'proxy6.bankom.omsk.su' => array('root', 'osme', 21),
    //'192.168.139.249' => array ('root', 'osme', 22),
    //'FreeBSD_2' => array ('repl_user', 'repl_pasword', 3)
  );

  //Если этот параметр существует, то при выыводи информации из БД САМС будет выполнятся преобразование кодировки
  //$config ['conv'] = array ('cp1252','cp1251');
?>